base/Catalogs/бит_РолиИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_РолиИсполнителей</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыАдресации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыОбъектовАдресацииЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Comment>Обязательный</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_РолиИсполнителей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Функция возвращает настройки объектов адресации.
// 
// Параметры:
//  РольИсполнителя - СправочникСсылка.бит_РолиИсполнителей.
// 
// Возвращаемое значение:
//  СтрНастройки - Структура.
// 
Функция НастройкиОбъектовАдресации(РольИсполнителя) Экспорт

	СтрНастройки = Новый Структура;
	
	Для каждого СтрокаТаблицы Из РольИсполнителя.ОбъектыАдресации Цикл
	
		НастройкаОбъекта = КонструкторНастройкиОбъектаАдресации(СтрокаТаблицы.Вид, СтрокаТаблицы.Обязательный);
		
		СтрНастройки.Вставить(СтрокаТаблицы.Имя, НастройкаОбъекта);
	
	КонецЦикла; 

	Возврат СтрНастройки;
	
КонецФункции // НастройкиОбъектовАдресации()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция инициализирует структуру настройки объкта адресации.
// 
// Параметры:
//  Вид - ПВХ.бит_ВидыОбъектовАдресацииЗадач.
//  Обязательный - Булево.
// 
// Возвращаемое значение:
//  СтрНастройка - Строка.
// 
Функция КонструкторНастройкиОбъектаАдресации(Вид, Обязательный)

	СтрНастройка = Новый Структура;
	СтрНастройка.Вставить("Вид", Вид);
	СтрНастройка.Вставить("Тип", Вид.ТипЗначения);
	СтрНастройка.Вставить("Синоним", Вид.Наименование);
	СтрНастройка.Вставить("Обязательный", Обязательный);

	Возврат СтрНастройка;
	
КонецФункции // КонструкторНастройкиОбъектаАдресации()

#КонецОбласти

#КонецЕсли
